In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})
dframe

   dataset1  dataset2 k1     k2
0  1.470962 -0.732810  X  alpha
1 -0.459897 -0.748508  X   beta
2  2.214771  1.219995  Y  alpha
3  1.441395 -0.129298  Y   beta
4 -1.749089  0.175975  Z  alpha

In [4]:
# k1をキーとして、データをグループにまとめます。
group1 = dframe['dataset1'].groupby(dframe['k1'])
group1

In [5]:
#グループごとの平均値を計算
group1.mean()

k1
X    0.505532
Y    1.828083
Z   -1.749089
Name: dataset1, dtype: float64

In [6]:
# キーは変えられます。
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])
#  それぞれでグループ化します。
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB   -0.459897
    JAN    2.214771
NY  FEB    1.441395
    JAN   -0.139063
Name: dataset1, dtype: float64

In [7]:
dframe

   dataset1  dataset2 k1     k2
0  1.470962 -0.732810  X  alpha
1 -0.459897 -0.748508  X   beta
2  2.214771  1.219995  Y  alpha
3  1.441395 -0.129298  Y   beta
4 -1.749089  0.175975  Z  alpha

In [8]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.505532 -0.740659
Y   1.828083  0.545348
Z  -1.749089  0.175975

In [9]:
# 複数の列名にも対応しています。
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  1.470962 -0.732810
   beta  -0.459897 -0.748508
Y  alpha  2.214771  1.219995
   beta   1.441395 -0.129298
Z  alpha -1.749089  0.175975

In [10]:
# size()と一緒に使うのも便利です。
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [11]:
# イテレート（繰り返し処理）ができます。
for name,group in dframe.groupby('k1'):
    print('This is the {} group'.format(name))
    print(group)
    print('\n')

This is the X group
   dataset1  dataset2 k1     k2
0  1.470962 -0.732810  X  alpha
1 -0.459897 -0.748508  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2  2.214771  1.219995  Y  alpha
3  1.441395 -0.129298  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4 -1.749089  0.175975  Z  alpha

In [12]:
# 複数のキーでも同じ事ができます。
for (k1,k2) , group in dframe.groupby(['k1','k2']):
    print('Key1 = {} Key2 = {}'.format(k1,k2))
    print(group)
    print('\n')

Key1 = X Key2 = alpha
   dataset1  dataset2 k1     k2
0  1.470962  -0.73281  X  alpha


Key1 = X Key2 = beta
   dataset1  dataset2 k1    k2
1 -0.459897 -0.748508  X  beta


Key1 = Y Key2 = alpha
   dataset1  dataset2 k1     k2
2  2.214771  1.219995  Y  alpha


Key1 = Y Key2 = beta
   dataset1  dataset2 k1    k2
3  1.441395 -0.129298  Y  beta


Key1 = Z Key2 = alpha
   dataset1  dataset2 k1     k2
4 -1.749089  0.175975  Z  alpha

In [16]:
# 列を限定することもできます。
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]
dataset2_group.mean()

          dataset2
k1 k2
X  alpha -0.732810
   beta  -0.748508
Y  alpha  1.219995
   beta  -0.129298
Z  alpha  0.175975

In [17]:
gr = dframe.groupby('k1')
gr.get_group('X')

   dataset1  dataset2 k1     k2
0  1.470962 -0.732810  X  alpha
1 -0.459897 -0.748508  X   beta

In [18]:
# リストを作ってそれを辞書にするこもできます。
group_dict = dict(list(dframe.groupby('k1')))
group_dict['X']

   dataset1  dataset2 k1     k2
0  1.470962 -0.732810  X  alpha
1 -0.459897 -0.748508  X   beta

In [19]:
# 列方向（axis = 1）についても同じような事ができます。
# ちょっと複雑ですが、データ型でgroup by してみます。
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  1.470962 -0.732810
 1 -0.459897 -0.748508
 2  2.214771  1.219995
 3  1.441395 -0.129298
 4 -1.749089  0.175975, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [29]:
animals = DataFrame(np.arange(16).reshape(4, 4),
                   columns=['W', 'X', 'Y', 'Z'],
                   index=['Dog', 'Cat', 'Bird', 'Mouse'])
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [30]:
# 一部をNaNにします。
animals.loc[1:2, ['W', 'Y']] = np.nan 
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [27]:
# お行儀のよさをデータ化します。
behavior_map = {'W': 'bad', 'X': 'good', 'Y': 'bad','Z': 'good'}

In [31]:
# mapを使ってグループ化します。
animal_col = animals.groupby(behavior_map, axis=1)
animal_col.sum()

        bad  good
Dog     2.0   4.0
Cat     NaN  12.0
Bird   18.0  20.0
Mouse  26.0  28.0

In [32]:
# Seriesを作ります。
behav_series = Series(behavior_map)
behav_series

W     bad
X    good
Y     bad
Z    good
dtype: object

In [35]:
# このSeriesを使ってグループ化します。
animals.groupby(behav_series, axis=1).count()

       bad  good
Dog      2     2
Cat      0     2
Bird     2     2
Mouse    2     2

In [36]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [37]:
# 関数を渡す事もできます。
animals.groupby(len).sum()

      W   X     Y   Z
3   0.0   6   2.0  10
4   8.0   9  10.0  11
5  12.0  13  14.0  15

In [38]:
# 関数と、キーを混ぜることもできます。
keys = ['A', 'B', 'A', 'B']
# indexの長さと、別のキーを使ってグループ化
animals.groupby([len, keys]).max()

        W   X     Y   Z
3 A   0.0   1   2.0   3
  B   NaN   5   NaN   7
4 A   8.0   9  10.0  11
5 B  12.0  13  14.0  15